app/controllers/items_controller.rb

	  def create
	  	params[:item][:user_id]=current_user.id
	  	@item=Item.create(item_params)
---
INSERT INTO "items" ("name", "user_id", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "uhuyy"], ["user_id", 4], ["description", "09-9-90"], ["created_at", "2017-12-20 12:52:08.835633"], ["updated_at", "2017-12-20 12:52:08.835633"]]

	  def update
	  	@item.update(item_params)
---
UPDATE "items" SET "description" = ?, "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "items"."id" = ?

	  def destroy
     @item.destroy
---
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 1]]

	  def set_item
	  	@item=Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]